In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn as sk
import seaborn as sns

In [2]:
df100k = pd.read_csv('poker100k.csv')
df100k.head()

,First Card,Second Card,Third Card,Fourth Card,Fifth Card,Result
0,Nine Hearts,Ten Spades,King Hearts,King Clubs,Jack Spades,Pair
1,Ace Clubs,Queen Diamonds,Jack Spades,Jack Clubs,Ace Spades,Two Pairs
2,King Hearts,Nine Diamonds,Queen Hearts,Ten Clubs,Ten Diamonds,Pair
3,Nine Hearts,Nine Diamonds,Ace Diamonds,Jack Clubs,Queen Spades,Pair
4,Nine Diamonds,Nine Spades,Nine Hearts,King Spades,Nine Clubs,Four of a Kind

In [3]:
df100k.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100128 entries, 0 to 100127
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   First Card   100128 non-null  object
 1   Second Card  100128 non-null  object
 2   Third Card   100128 non-null  object
 3   Fourth Card  100128 non-null  object
 4   Fifth Card   100128 non-null  object
 5   Result       100128 non-null  object
dtypes: object(6)
memory usage: 4.6+ MB

In [4]:
df100k.describe()

       First Card  Second Card   Third Card  Fourth Card    Fifth Card  Result
count      100128       100128       100128       100128        100128  100128
unique         24           24           24           24            24       6
top     Ten Clubs  Nine Spades  Queen Clubs  King Spades  Queen Spades    Pair
freq         4313         4309         4349         4333          4297   54288

In [5]:
#unique values from each column
df100k.nunique()

First Card     24
Second Card    24
Third Card     24
Fourth Card    24
Fifth Card     24
Result          6
dtype: int64

In [7]:
#check for null values
df100k.isnull().sum()

First Card     0
Second Card    0
Third Card     0
Fourth Card    0
Fifth Card     0
Result         0
dtype: int64

In [10]:
#create a new df for changing the object values to numeric
df100k_num = df100k.copy()

In [ ]:
#change the object values to numeric